{"format": "graph-model", "generatedBy": "2.15.1", "convertedBy": "TensorFlow.js Converter v4.10.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "63"}]}}}, "outputs": {"dense_5": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "27"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_3/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_2/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/value/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/value/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "16"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_2/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_2/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_2/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_2/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_3/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_3/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_3/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/layer_normalization_3/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/global_average_pooling1d/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "27"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "27"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "63"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Shape", "op": "Shape", "input": ["input_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/asl_transformer/dense/Tensordot/Shape", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/axes", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/asl_transformer/dense/Tensordot/Shape", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/free", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/asl_transformer/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/asl_transformer/dense/Tensordot/GatherV2", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/asl_transformer/dense/Tensordot/GatherV2", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Const_2", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/asl_transformer/dense/Tensordot/Prod", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/Reshape", "op": "Reshape", "input": ["input_1", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/asl_transformer/dense/Tensordot/Reshape", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/asl_transformer/dense/Tensordot/MatMul", "StatefulPartitionedCall/asl_transformer/dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/asl_transformer/dense/Tensordot", "StatefulPartitionedCall/asl_transformer/dense/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/dense/BiasAdd", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/key/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/dense/BiasAdd", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/query/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/dense/BiasAdd", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/value/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/key/add", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/key/einsum/Einsum", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/key/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/query/add", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/query/einsum/Einsum", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/query/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/value/add", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/value/einsum/Einsum", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/value/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/query/add", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/key/add", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/Mul"], "attr": {"equation": {"s": "YWVjZCxhYmNkLT5hY2Jl"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/einsum/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/softmax/Softmax", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/value/add"], "attr": {"equation": {"s": "YWNiZSxhZWNkLT5hYmNk"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/attention_output/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/einsum_1/Einsum", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/attention_output/einsum/Einsum/ReadVariableOp"], "attr": {"equation": {"s": "YWJjZCxjZGUtPmFiZQ=="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/asl_transformer/dense/BiasAdd", "StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/attention_output/einsum/Einsum"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/multi_head_attention/attention_output/add/ReadVariableOp", "StatefulPartitionedCall/asl_transformer/tb1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/asl_transformer/tb1/ArithmeticOptimizer/AddOpsRewrite_add", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/asl_transformer/tb1/ArithmeticOptimizer/AddOpsRewrite_add", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/SquaredDifference", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/variance", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/Rsqrt", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/moments/mean", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/asl_transformer/tb1/ArithmeticOptimizer/AddOpsRewrite_add", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/ReadVariableOp", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/mul_1", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Shape", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/axes", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Shape", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/free", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/GatherV2_1", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/GatherV2", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/GatherV2", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Const_2", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Prod", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/add_1", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/Reshape", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/MatMul", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Tensordot", "StatefulPartitionedCall/asl_transformer/tb1/dense_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Shape", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/axes", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Shape", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/free", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/GatherV2", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/GatherV2", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Const_2", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Prod", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense_1/Relu", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/Reshape", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/MatMul", "StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/asl_transformer/tb1/dense/Tensordot", "StatefulPartitionedCall/asl_transformer/tb1/dense/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization/batchnorm/add_1", "StatefulPartitionedCall/asl_transformer/tb1/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/asl_transformer/tb1/add_1", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/asl_transformer/tb1/add_1", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/SquaredDifference", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/variance", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/Rsqrt", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/moments/mean", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/asl_transformer/tb1/add_1", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/ReadVariableOp", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/add_1", "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/key/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/add_1", "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/query/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/tb1/layer_normalization_1/batchnorm/add_1", "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/value/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/key/add", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/key/einsum/Einsum", "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/key/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/query/add", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/query/einsum/Einsum", "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/query/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/value/add", "op": "AddV2", "input": ["StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/value/einsum/Einsum", "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/value/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/query/add", "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/key/add", "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/Mul"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWVjZCxhYmNkLT5hY2Jl"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/einsum/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/softmax/Softmax", "StatefulPartitionedCall/asl_transformer/tb2/multi_head_attention_1/value/add"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWNiZSxhZWNkLT5hYmNk"}, "T": {"type": "DT_FLOAT"}}}, {"name": 